content/about.md
+++
title = "about me"
author = ["peregrinator"]
draft = false
toc = false
layout = "about"
+++

I'm a 27 year old, neurodivergent cat supremacist that sometimes
cosplays as an ecologist. I'm big on F(L)OSS and currently run a [Void
Linux](https://voidlinux.org) installation with a manually compiled version of Emacs 29. I
also play the guitar, listen to typically a lot of metal and try to
make my own music occasionally. I currently use [Ardour 7.0](https://ardour.org) for audio
production, which I'm very new to, and hope to get started with the
[Sonic Pi](https://sonic-pi.net) as both a standalone instrument as well as a synth for
instruments I don't play myself.

This is a _static_ website and is intended to (eventually) be the home
for my blog, Emacs configuration and work updates. I hope to
eventually move to or host it there. This website uses a stylised
version of the theme from [Drew Devault](https://drewdevault.com)'s blog within the same [Hugo](https://gohugo.io)
framework. Everything you see here was written in [Org-mode](https:orgmode.org) on Emacs,
exported to markdown via [ox-hugo](https://github.com/kaushalmodi/ox-hugo) for better compatibility - the
default [go-org](https://github.com/niklasfasching/go-org) parser doesn't appear to handle Org syntax
adequately. Read more about my blogging flow on my [post](/blog/2022/12/hugo-org-and-starting-over-at-a-new-blog.html) about it.


## Publications {#publications}

This will be updated shortly.


## Links {#links}

[Source](https://github.com/brihadeesh/brihadeesh.github.io) for this website:
